In [1]:
import pandas as pd
import numpy as np  #

In [2]:
# array oriented library 
arr = np.array([[1,2,3,4,5,6],[3,3,4,4,5,6]])

In [3]:
arr.shape

(2, 6)

In [4]:
col = 'one two three four five six'.split(' ')
sample= pd.DataFrame(arr, columns= col)

In [5]:
# Series
# Dataframes
sample

   one  two  three  four  five  six
0    1    2      3     4     5    6
1    3    3      4     4     5    6

In [6]:
type(sample['one'])

pandas.core.series.Series

In [7]:
sample['one']

0    1
1    3
Name: one, dtype: int64

In [8]:
# series
indx= 'a b c d e'.split(' ')
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
a = pd.Series([1,2,3,4,5],index=indx, dtype= 'int32',name= 'random_number')
pd.DataFrame(a)
# a

   random_number
a              1
b              2
c              3
d              4
e              5

In [10]:
# map(func, [iterable])  pure function
def mul(x):
    return x*2

list_item = [1,2,3,4,5,6]
for i in list_item:
    mul(i) 
list(map(mul,list_item))

[2, 4, 6, 8, 10, 12]

In [11]:
for i in a:
    print(i*2) #

2
4
6
8
10

In [12]:
a.map(mul)   # works on series

a     2
b     4
c     6
d     8
e    10
Name: random_number, dtype: int64

In [13]:
a.apply(mul)  #series and Dataframe

a     2
b     4
c     6
d     8
e    10
Name: random_number, dtype: int64

In [14]:
a[0:3]

a    1
b    2
c    3
Name: random_number, dtype: int32

In [15]:
a.values

array([1, 2, 3, 4, 5], dtype=int32)

In [16]:
np.array([1,2,3,4,5],dtype = 'int32')

array([1, 2, 3, 4, 5], dtype=int32)

In [17]:
one_s = pd.Series(['Monday', 'Tuesday','Wednessday'])
two_s = pd.Series(['New_York', 'Dallas','San_Fran'])
three_s = pd.Series(['Doctor', 'Lawyer','Plumber'],dtype = 'str')
four_s = pd.Series([1, 2,3])

In [18]:
# print(one_s)
# print(two_s)
print(three_s)
print(four_s)

0     Doctor
1     Lawyer
2    Plumber
dtype: object
0    1
1    2
2    3
dtype: int64

In [19]:
df1 = pd.DataFrame([one_s,two_s,three_s,four_s], index= ['a','b','c','d'])

In [20]:
df1.columns= ['a','b','c']

In [21]:
df1.columns = [x.upper() for x in df1.columns]

In [22]:
df1['A']

a      Monday
b    New_York
c      Doctor
d           1
Name: A, dtype: object

In [23]:
dict_1 = ['Monday', 'Tuesday','Wednessday']
dict_2 = ['New_York', 'Dallas','San_Fran']
dict_com = dict(zip(dict_1,dict_2))

In [24]:
df =pd.DataFrame(dict_com, index = ['a','b','c','d'])

In [25]:
df['Monday']  #pandas series

a    New_York
b    New_York
c    New_York
d    New_York
Name: Monday, dtype: object

In [26]:
df[['Monday','Tuesday']]

     Monday Tuesday
a  New_York  Dallas
b  New_York  Dallas
c  New_York  Dallas
d  New_York  Dallas

In [27]:
df.Monday   ##

a    New_York
b    New_York
c    New_York
d    New_York
Name: Monday, dtype: object

In [28]:
df['Thursday']= 'Yemen'

In [29]:
df

     Monday Tuesday Wednessday Thursday
a  New_York  Dallas   San_Fran    Yemen
b  New_York  Dallas   San_Fran    Yemen
c  New_York  Dallas   San_Fran    Yemen
d  New_York  Dallas   San_Fran    Yemen

In [30]:
df['Wednessday']= 'Egypt'

In [31]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [32]:
df.columns

Index(['Monday', 'Tuesday', 'Wednessday', 'Thursday'], dtype='object')

In [33]:
df.shape

(4, 4)

In [34]:
df.ndim

2

In [35]:
df.head(2)

     Monday Tuesday Wednessday Thursday
a  New_York  Dallas      Egypt    Yemen
b  New_York  Dallas      Egypt    Yemen

In [36]:
df.tail(2)

     Monday Tuesday Wednessday Thursday
c  New_York  Dallas      Egypt    Yemen
d  New_York  Dallas      Egypt    Yemen

In [37]:
df.reindex(['x','y','z','m'])

  Monday Tuesday Wednessday Thursday
x    NaN     NaN        NaN      NaN
y    NaN     NaN        NaN      NaN
z    NaN     NaN        NaN      NaN
m    NaN     NaN        NaN      NaN

In [38]:
df.size

16

In [39]:
df.describe()

          Monday Tuesday Wednessday Thursday
count          4       4          4        4
unique         1       1          1        1
top     New_York  Dallas      Egypt    Yemen
freq           4       4          4        4

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Monday      4 non-null      object
 1   Tuesday     4 non-null      object
 2   Wednessday  4 non-null      object
 3   Thursday    4 non-null      object
dtypes: object(4)
memory usage: 320.0+ bytes

In [41]:
df['Friday']= 20

In [42]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [43]:
# loc vs ILoc

df.loc[['a','c','d'],['Monday','Friday']]  #label names  row, col start and stop at
df.loc[:,['Monday']]

     Monday
a  New_York
b  New_York
c  New_York
d  New_York

In [44]:
a[1:3]  #start and stop before

b    2
c    3
Name: random_number, dtype: int32

In [45]:
df.columns = [x for x in range(len(df.columns))]

In [46]:
len(df.columns)

5

In [47]:
for i in range(len(df.columns)):
    print(i)

0
1
2
3
4

In [48]:
# df.loc[:,[0,1,4]]
df.loc[:,1:2]

        1      2
a  Dallas  Egypt
b  Dallas  Egypt
c  Dallas  Egypt
d  Dallas  Egypt

In [49]:
df.iloc[:,1:2]  #row, col

        1
a  Dallas
b  Dallas
c  Dallas
d  Dallas

In [50]:
df = df.drop(1,axis='columns')

In [51]:
df

          0      2      3   4
a  New_York  Egypt  Yemen  20
b  New_York  Egypt  Yemen  20
c  New_York  Egypt  Yemen  20
d  New_York  Egypt  Yemen  20

In [52]:
df.drop(0,axis='columns',inplace= True)

In [53]:
df.loc['a',4]= 50

In [54]:
filt = df[4]== 50


df[~filt]  # df[4]!= 50

       2      3   4
b  Egypt  Yemen  20
c  Egypt  Yemen  20
d  Egypt  Yemen  20

In [55]:
# df.loc['a',4]
df[4]== 50

a     True
b    False
c    False
d    False
Name: 4, dtype: bool

In [56]:
df

       2      3   4
a  Egypt  Yemen  50
b  Egypt  Yemen  20
c  Egypt  Yemen  20
d  Egypt  Yemen  20

In [57]:
df.eval('c = 6')

       2      3   4  c
a  Egypt  Yemen  50  6
b  Egypt  Yemen  20  6
c  Egypt  Yemen  20  6
d  Egypt  Yemen  20  6

In [58]:
import os
os.listdir(os.getcwd())

['file.txt',
 'Returned_Items.txt',
 '.DS_Store',
 'Sales_Transactions.txt',
 'day12.ipynb',
 '.ipynb_checkpoints',
 'data',
 'Regional_Managers.txt']

In [59]:
df_returned_items = pd.read_csv('Returned_Items.txt', sep= '\t')

In [60]:
df_returned_items.head(2)

   OrderID    Status
0       65  Returned
1       69  Returned

In [61]:
a = [1,2,3]
for i in a:
    print(i, end='\t')

1	2	3

In [62]:
df_reg_mangr = pd.read_csv('Regional_Managers.txt', sep = '\t')
type(df_reg_mangr)

pandas.core.frame.DataFrame

In [63]:
df_reg_mangr.head(3)

                  Region Manager
0                Nunavut   Chris
1  Northwest_Territories    Erin
2               Atlantic     Sam

In [64]:
raw_data = pd.read_csv('Sales_Transactions.txt',error_bad_lines= False, encoding='latin',sep = '\t', index_col= 'Row ID') #
raw_data

,Order ID,Order Date,Order Priority,Order Quantity,Sales,Discount,Ship Mode,Profit,Unit Price,Shipping Cost,...,Last Name,Region,Customer Segment,Product Category,Product Sub-Category,Product Name,Product Container,Product Base Margin,Ship Date,BirthDate
Row ID,,,,,,,,,,,,,,,,,,,,,
1,3,~40464%,Low,06/01/1900,261.5400,0.04,Regular Air,-213.25,38.94,35.00,...,MacIntyre,Nunavut,Small Business,Office Supplies,Storage & Organization,"Eldon Base for stackable storage shelf, platinum",Large Box,0.80,20/10/2010,08/04/1970
49,293,~41183%,High,18/02/1900,10123.0200,0.07,Delivery Truck,457.81,208.16,68.02,...,French,Nunavut,Consumer,Office Supplies,Appliances,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Jumbo Drum,0.58,02/10/2012,14/05/1969
50,293,~41183%,High,27/01/1900,244.5700,0.01,Regular Air,46.71,8.69,2.99,...,French,Nunavut,Consumer,Office Supplies,Binders and Binder Accessories,"Cardinal Slant-D Ring Binder, Heavy Gauge Vinyl",Small Box,0.39,03/10/2012,12/08/1969
80,483,~40734%,High,30/01/1900,4965.7595,0.08,Regular Air,1198.97,195.99,3.99,...,Rozendal,Nunavut,Corporate,Technology,Telephones and Communication,R380,Small Box,0.58,12/07/2011,15/02/1972
85,515,~40418%,Not Specified,19/01/1900,394.2700,0.08,Regular Air,30.94,21.78,5.94,...,Soltero,Nunavut,Consumer,Office Supplies,Appliances,Holmes HEPA Air Purifier,Medium Box,0.50,30/08/2010,08/08/1972
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7765,55558,~40399%,Medium,08/01/1900,1294.0400,0.05,Delivery Truck,-323.18,150.98,66.27,...,Brown,West,Consumer,Furniture,Bookcases,Bush Mission Pointe Library,Jumbo Box,0.65,09/08/2010,16/06/1965
7766,55558,~40399%,Medium,23/01/1900,392.5700,0.04,Regular Air,22.25,17.07,8.13,...,Brown,West,Consumer,Office Supplies,Envelopes,Recycled Interoffice Envelopes with Re-Use-A-S...,Small Box,0.38,11/08/2010,01/06/1964
7906,56550,~40641%,Not Specified,06/02/1900,823.7800,0.03,Express Air,343.05,22.23,5.08,...,Hawley,West,Home Office,Furniture,Office Furnishings,"Executive Impressions 14""",Small Pack,0.41,10/04/2011,11/03/1964
7907,56550,~40641%,Not Specified,08/01/1900,469.8375,0.00,Regular Air,-159.24,65.99,8.99,...,Hawley,West,Home Office,Technology,Telephones and Communication,Talkabout T8367,Small Box,0.56,09/04/2011,27/08/1964
7914,56581,~39852%,High,20/01/1900,2026.0100,0.10,Express Air,580.43,105.98,13.99,...,Donatelli,West,Consumer,Furniture,Office Furnishings,"Tenex 46"" x 60"" Computer Anti-Static Chairmat,...",Medium Box,0.65,11/02/2009,09/10/1964

In [65]:
# raw_data.tail()
# # head/tail
# len(raw_data.columns)
# len(raw_data.index)
# raw_data.columns

In [66]:
raw_data.columns = [x.lower() for x in raw_data.columns]
# raw_data.columns
# raw_data['order id']

In [67]:
raw_data.columns = [x.replace(' ','_').title() for x in raw_data.columns]
raw_data.columns = [x.lower() for x in raw_data.columns]

In [68]:
raw_data.columns
type(raw_data[['order_id']])

pandas.core.frame.DataFrame

In [69]:
raw_data.head(2)

,order_id,order_date,order_priority,order_quantity,sales,discount,ship_mode,profit,unit_price,shipping_cost,...,last_name,region,customer_segment,product_category,product_sub-category,product_name,product_container,product_base_margin,ship_date,birthdate
Row ID,,,,,,,,,,,,,,,,,,,,,
1,3,~40464%,Low,06/01/1900,261.54,0.04,Regular Air,-213.25,38.94,35.00,...,MacIntyre,Nunavut,Small Business,Office Supplies,Storage & Organization,"Eldon Base for stackable storage shelf, platinum",Large Box,0.80,20/10/2010,08/04/1970
49,293,~41183%,High,18/02/1900,10123.02,0.07,Delivery Truck,457.81,208.16,68.02,...,French,Nunavut,Consumer,Office Supplies,Appliances,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Jumbo Drum,0.58,02/10/2012,14/05/1969

In [70]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8399 entries, 1 to 7914
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   order_id              8399 non-null   int64
 1   order_date            8399 non-null   object
 2   order_priority        8399 non-null   object
 3   order_quantity        8399 non-null   object
 4   sales                 8399 non-null   float64
 5   discount              8399 non-null   float64
 6   ship_mode             8369 non-null   object
 7   profit                8399 non-null   float64
 8   unit_price            8399 non-null   float64
 9   shipping_cost         8399 non-null   float64
 10  first_name            8399 non-null   object
 11  last_name             8399 non-null   object
 12  region                8399 non-null   object
 13  customer_segment      8399 non-null   object
 14  product_category      8399 non-null   object
 15  product_sub-category  8399 non-null   object
 16  product_name          8399 non-null   object
 17  product_container     8399 non-null   object
 18  product_base_margin   8336 non-null   float64
 19  ship_date             8399 non-null   object
 20  birthdate             8369 non-null   object
dtypes: float64(6), int64(1), object(14)
memory usage: 1.4+ MB

In [71]:
 # no of null values in your data set
raw_data.loc[:, raw_data.isna().any()]

             ship_mode  product_base_margin   birthdate
Row ID
1          Regular Air                 0.80  08/04/1970
49      Delivery Truck                 0.58  14/05/1969
50         Regular Air                 0.39  12/08/1969
80         Regular Air                 0.58  15/02/1972
85         Regular Air                 0.50  08/08/1972
...                ...                  ...         ...
7765    Delivery Truck                 0.65  16/06/1965
7766       Regular Air                 0.38  01/06/1964
7906       Express Air                 0.41  11/03/1964
7907       Regular Air                 0.56  27/08/1964
7914       Express Air                 0.65  09/10/1964

[8399 rows x 3 columns]

In [72]:
# regular expresssion
# loop
# apply

In [73]:
proc_data = raw_data.copy()

In [74]:
proc_data= proc_data['order_date'].str.extract(r'(\d+)')

In [75]:
print(r'abl\ne')
print('abl\ne')

abl\ne
abl
e

In [76]:
proc_2 = raw_data.copy()

In [77]:
proc_2['order_date']= proc_2['order_date'].str.replace('~','').str.replace('%','')

In [78]:
proc_2['order_date']=  pd.to_datetime((proc_2['order_date'].astype(int)-25569) *86400.0 ,unit= 's')

In [79]:
proc_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8399 entries, 1 to 7914
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   order_id              8399 non-null   int64
 1   order_date            8399 non-null   datetime64[ns]
 2   order_priority        8399 non-null   object
 3   order_quantity        8399 non-null   object
 4   sales                 8399 non-null   float64
 5   discount              8399 non-null   float64
 6   ship_mode             8369 non-null   object
 7   profit                8399 non-null   float64
 8   unit_price            8399 non-null   float64
 9   shipping_cost         8399 non-null   float64
 10  first_name            8399 non-null   object
 11  last_name             8399 non-null   object
 12  region                8399 non-null   object
 13  customer_segment      8399 non-null   object
 14  product_category      8399 non-null   object
 15  product_sub-category  8399 non-null   object
 16  product_name          8399 non-null   object
 17  product_container     8399 non-null   object
 18  product_base_margin   8336 non-null   float64
 19  ship_date             8399 non-null   object
 20  birthdate             8369 non-null   object
dtypes: datetime64[ns](1), float64(6), int64(1), object(13)
memory usage: 1.4+ MB

In [80]:
proc_2[['ship_date','birthdate']]= proc_2[['ship_date','birthdate']].astype('datetime64[ns]')

In [81]:
proc_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8399 entries, 1 to 7914
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   order_id              8399 non-null   int64
 1   order_date            8399 non-null   datetime64[ns]
 2   order_priority        8399 non-null   object
 3   order_quantity        8399 non-null   object
 4   sales                 8399 non-null   float64
 5   discount              8399 non-null   float64
 6   ship_mode             8369 non-null   object
 7   profit                8399 non-null   float64
 8   unit_price            8399 non-null   float64
 9   shipping_cost         8399 non-null   float64
 10  first_name            8399 non-null   object
 11  last_name             8399 non-null   object
 12  region                8399 non-null   object
 13  customer_segment      8399 non-null   object
 14  product_category      8399 non-null   object
 15  product_sub-category  8399 non-null   object
 16  product_name          8399 non-null   object
 17  product_container     8399 non-null   object
 18  product_base_margin   8336 non-null   float64
 19  ship_date             8399 non-null   datetime64[ns]
 20  birthdate             8369 non-null   datetime64[ns]
dtypes: datetime64[ns](3), float64(6), int64(1), object(11)
memory usage: 1.4+ MB

In [82]:
# proc_2[['order_priority','ship_mode','product_category','customer_segment','product_sub-category']]= proc_data[['order_priority','ship_mode','product_category','customer_segment','product_sub-category']].astype('category')

KeyError: "None of [Index(['order_priority', 'ship_mode', 'product_category', 'customer_segment',\n       'product_sub-category'],\n      dtype='object')] are in the [columns]"

In [ ]:
# interpolate
# fill null values
# drop

In [83]:
proc_2.isnull().sum()

order_id                 0
order_date               0
order_priority           0
order_quantity           0
sales                    0
discount                 0
ship_mode               30
profit                   0
unit_price               0
shipping_cost            0
first_name               0
last_name                0
region                   0
customer_segment         0
product_category         0
product_sub-category     0
product_name             0
product_container        0
product_base_margin     63
ship_date                0
birthdate               30
dtype: int64

In [85]:
proc_2['product_base_margin']= proc_2['product_base_margin'].fillna(0)
proc_2.isnull().sum()

order_id                 0
order_date               0
order_priority           0
order_quantity           0
sales                    0
discount                 0
ship_mode               30
profit                   0
unit_price               0
shipping_cost            0
first_name               0
last_name                0
region                   0
customer_segment         0
product_category         0
product_sub-category     0
product_name             0
product_container        0
product_base_margin      0
ship_date                0
birthdate               30
dtype: int64

In [86]:
proc_2['birthdate']= proc_2['birthdate'].fillna(method='ffill')

In [87]:
df = pd.DataFrame({'A': ['1','2','3','4','5'],'B': 10})
df['B']= np.nan
df.isnull().sum()

A    0
B    5
dtype: int64

In [88]:
df.loc[0,'B'] = 20
df.loc[3,'B'] = 30

# df.interpolate(method='linear')
df['B'].fillna(np.mean(df['B']))

0    20.0
1    25.0
2    25.0
3    30.0
4    25.0
Name: B, dtype: float64

In [89]:
df['B'].fillna(method='bfill')

0    20.0
1    30.0
2    30.0
3    30.0
4     NaN
Name: B, dtype: float64

In [90]:
proc_2.isnull().sum()

order_id                 0
order_date               0
order_priority           0
order_quantity           0
sales                    0
discount                 0
ship_mode               30
profit                   0
unit_price               0
shipping_cost            0
first_name               0
last_name                0
region                   0
customer_segment         0
product_category         0
product_sub-category     0
product_name             0
product_container        0
product_base_margin      0
ship_date                0
birthdate                0
dtype: int64

In [91]:
proc_2= proc_2.dropna() # droped rows

In [92]:
# axis_0.count()

In [93]:
axis_1= proc_2.dropna(axis=1)

In [94]:
axis_1.count()

order_id                8369
order_date              8369
order_priority          8369
order_quantity          8369
sales                   8369
discount                8369
ship_mode               8369
profit                  8369
unit_price              8369
shipping_cost           8369
first_name              8369
last_name               8369
region                  8369
customer_segment        8369
product_category        8369
product_sub-category    8369
product_name            8369
product_container       8369
product_base_margin     8369
ship_date               8369
birthdate               8369
dtype: int64

In [95]:
# print(len(axis_0.columns))
# print(len(axis_1.columns))

In [96]:
df_reg_mangr  #managers
df_returned_items  #items that have been returned
proc_2  # sales

,order_id,order_date,order_priority,order_quantity,sales,discount,ship_mode,profit,unit_price,shipping_cost,...,last_name,region,customer_segment,product_category,product_sub-category,product_name,product_container,product_base_margin,ship_date,birthdate
Row ID,,,,,,,,,,,,,,,,,,,,,
1,3,2010-10-13,Low,06/01/1900,261.5400,0.04,Regular Air,-213.25,38.94,35.00,...,MacIntyre,Nunavut,Small Business,Office Supplies,Storage & Organization,"Eldon Base for stackable storage shelf, platinum",Large Box,0.80,2010-10-20,1970-08-04
49,293,2012-10-01,High,18/02/1900,10123.0200,0.07,Delivery Truck,457.81,208.16,68.02,...,French,Nunavut,Consumer,Office Supplies,Appliances,"1.7 Cubic Foot Compact ""Cube"" Office Refrigera...",Jumbo Drum,0.58,2012-02-10,1969-05-14
50,293,2012-10-01,High,27/01/1900,244.5700,0.01,Regular Air,46.71,8.69,2.99,...,French,Nunavut,Consumer,Office Supplies,Binders and Binder Accessories,"Cardinal Slant-D Ring Binder, Heavy Gauge Vinyl",Small Box,0.39,2012-03-10,1969-12-08
80,483,2011-07-10,High,30/01/1900,4965.7595,0.08,Regular Air,1198.97,195.99,3.99,...,Rozendal,Nunavut,Corporate,Technology,Telephones and Communication,R380,Small Box,0.58,2011-12-07,1972-02-15
85,515,2010-08-28,Not Specified,19/01/1900,394.2700,0.08,Regular Air,30.94,21.78,5.94,...,Soltero,Nunavut,Consumer,Office Supplies,Appliances,Holmes HEPA Air Purifier,Medium Box,0.50,2010-08-30,1972-08-08
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7765,55558,2010-08-09,Medium,08/01/1900,1294.0400,0.05,Delivery Truck,-323.18,150.98,66.27,...,Brown,West,Consumer,Furniture,Bookcases,Bush Mission Pointe Library,Jumbo Box,0.65,2010-09-08,1965-06-16
7766,55558,2010-08-09,Medium,23/01/1900,392.5700,0.04,Regular Air,22.25,17.07,8.13,...,Brown,West,Consumer,Office Supplies,Envelopes,Recycled Interoffice Envelopes with Re-Use-A-S...,Small Box,0.38,2010-11-08,1964-01-06
7906,56550,2011-04-08,Not Specified,06/02/1900,823.7800,0.03,Express Air,343.05,22.23,5.08,...,Hawley,West,Home Office,Furniture,Office Furnishings,"Executive Impressions 14""",Small Pack,0.41,2011-10-04,1964-11-03
7907,56550,2011-04-08,Not Specified,08/01/1900,469.8375,0.00,Regular Air,-159.24,65.99,8.99,...,Hawley,West,Home Office,Technology,Telephones and Communication,Talkabout T8367,Small Box,0.56,2011-09-04,1964-08-27
7914,56581,2009-02-08,High,20/01/1900,2026.0100,0.10,Express Air,580.43,105.98,13.99,...,Donatelli,West,Consumer,Furniture,Office Furnishings,"Tenex 46"" x 60"" Computer Anti-Static Chairmat,...",Medium Box,0.65,2009-11-02,1964-09-10

In [97]:
proc_2['region']= proc_2['region'].str.replace(' ','_')
proc_2['region'].unique()
df_reg_mangr['Region'].unique()

<ipython-input-97-b1f4ae7ebfd5>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  proc_2['region']= proc_2['region'].str.replace(' ','_')

array(['Nunavut', 'Northwest_Territories', 'Atlantic', 'Prarie', 'West',
       'Ontario', 'Quebec', 'Yukon'], dtype=object)

In [98]:
df_comb =pd.merge(proc_2,df_reg_mangr,how='left',left_on='region', right_on='Region')

In [99]:
df_final_comnined = pd.merge(df_comb,df_returned_items,how='left',left_on='order_id', right_on='OrderID')

In [100]:
# df_final_comnined.loc[~pd.notnull(df_final_comnined['Status'])]['Status']= 'Not Returned'

In [101]:
df_final_comnined['Status']= df_final_comnined['Status'].fillna('Not Returned')
df_final_comnined.drop(['Region','OrderID'], inplace= True, axis= 1)

In [108]:
df_final_comnined.to_csv('cleaned_data.csv')

In [103]:
a= df_final_comnined.groupby('Manager').agg({'profit':np.sum, 'Status': 'count', 'sales':np.mean})

In [104]:
profit =df_final_comnined.groupby('region').agg({'profit':'sum'}) #.plot(kind= 'hist', bins= 10)

In [105]:
df_final_comnined.describe()

,order_id,sales,discount,profit,unit_price,shipping_cost,product_base_margin
count,8369.000000,8369.000000,8369.000000,8369.000000,8369.000000,8369.000000,8369.000000
mean,29964.842753,1778.424315,0.049636,181.461154,89.445292,12.858944,0.508571
std,17259.201405,3590.364161,0.031833,1198.514750,290.805873,17.285673,0.142080
min,3.000000,2.240000,0.000000,-14140.700000,0.990000,0.490000,0.000000
25%,15014.000000,143.290000,0.020000,-83.330000,6.480000,3.300000,0.380000
50%,29827.000000,449.170000,0.050000,-1.500000,20.990000,6.120000,0.520000
75%,44583.000000,1711.790000,0.080000,163.100000,85.990000,13.990000,0.590000
max,59973.000000,89061.050000,0.250000,27220.690000,6783.020000,164.730000,0.850000

In [106]:
a

            profit  Status        sales
Manager
Chris      2841.11      79  1473.120044
Erin     100854.26     392  2037.755917
Pat      856524.53    5122  1781.847242
Sam      237196.40    1076  1865.095040
William  321232.10    1700  1667.642619

In [107]:
a.stack()

Manager
Chris    profit      2841.110000
         Status        79.000000
         sales       1473.120044
Erin     profit    100854.260000
         Status       392.000000
         sales       2037.755917
Pat      profit    856524.530000
         Status      5122.000000
         sales       1781.847242
Sam      profit    237196.400000
         Status      1076.000000
         sales       1865.095040
William  profit    321232.100000
         Status      1700.000000
         sales       1667.642619
dtype: float64

In [ ]:
a.melt(id_vars='profit').unstack()

In [ ]:
for _, i in profit[['profit']].iterrows():  #gen
    print(i[0] * 10 )